Repository: amrezz13/Nahla
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: BeeKeeper
ar: نحّال

# tagline
source: Manage your hives smartly
ar: عالم النحل

source: Welcome
ar: مرحباً

source: Today
ar: اليوم

source: Sun
ar: أحد

source: Mon
ar: إثنين

source: Tue
ar: ثلاثاء

source: Wed
ar: أربعاء

source: Thu
ar: خميس

source: Fri
ar: جمعة

source: Sat
ar: سبت

# weatherClear
source: Clear sky
ar: سماء صافية

# weatherMainlyClear
source: Mainly clear
ar: صافية في الغالب

# weatherPartlyCloudy
source: Partly cloudy
ar: غائم جزئياً

# weatherOvercast
source: Overcast
ar: غائمة

# weatherFoggy
source: Foggy
ar: ضبابية

# weatherDrizzle
source: Drizzle
ar: رذاذ

# weatherRainy
source: Rainy
ar: ماطر

# weatherFreezingRain
source: Freezing rain
ar: مطر متجمد

# weatherSnowy
source: Snowy
ar: ثلجية

# weatherRainShowers
source: Rain showers
ar: زخات مطر

# weatherThunderstorm
source: Thunderstorm
ar: عاصفة رعدية

# weatherUnknown
source: Unknown
ar: غير معروف

# windN
source: N
ar: شمال

# windNE
source: NE
ar: شمال شرق

# windE
source: E
ar: شرق

# windSE
source: SE
ar: جنوب شرق

# windS
source: S
ar: جنوب

# windSW
source: SW
ar: جنوب غرب

# windW
source: W
ar: غرب

# windNW
source: NW
ar: شمال غرب

# beeTooCold
source: Too cold for bee activity
ar: بارد جداً لنشاط النحل

# beeSluggish
source: Bees may be sluggish
ar: قد يكون النحل بطيئاً

# beeGoodTemp
source: Good temperature for bees
ar: درجة حرارة جيدة للنحل

# beeHot
source: Hot - ensure water source
ar: حار - تأكد من وجود مصدر مياه

# beeTooHot
source: Too hot - bees may beard
ar: حار جداً - قد يتجمع النحل خارج الخلية

# beeLowHumidity
source: Low humidity - check water
ar: رطوبة منخفضة - تحقق من المياه

# beeHighHumidity
source: High humidity - ventilation needed
ar: رطوبة عالية - التهوية مطلوبة

# beeTooWindy
source: Too windy for inspection
ar: رياح قوية جداً للفحص

# beeWindy
source: Windy - bees may be defensive
ar: رياح - قد يكون النحل دفاعياً

# beeRainy
source: Rainy - no inspection today
ar: ممطر - لا فحص اليوم

# beeShowers
source: Showers - wait for clear weather
ar: زخات - انتظر الطقس الصافي

# beeStorm
source: Storm - stay indoors
ar: عاصفة - ابق في الداخل

# beeGreatDay
source: Great day for beekeeping!
ar: يوم رائع لتربية النحل!

source: Get Started
ar: ابدأ الآن

source: Skip
ar: تخطي

source: Next
ar: التالي

source: Back
ar: رجوع

source: Login
ar: تسجيل الدخول

source: Register
ar: إنشاء حساب

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Weather
ar: الطقس

source: Temperature
ar: درجة الحرارة

source: Humidity
ar: الرطوبة

source: Wind
ar: الرياح

source: Hourly Forecast
ar: التوقعات بالساعة

# dailyForecast
source: 7-Day Forecast
ar: توقعات 7 أيام

source: Beekeeping Conditions
ar: ظروف تربية النحل

source: Loading...
ar: جاري التحميل...

source: Error
ar: خطأ

source: Try Again
ar: حاول مرة أخرى

# manageApiaries
source: Manage Your Apiaries
ar: إدارة المناحل

# manageApiariesDesc
source: Track all your hives in one place. Monitor locations, colonies, and equipment.
ar: تتبع جميع خلاياك في مكان واحد. راقب المواقع والمستعمرات والمعدات.

source: Track Inspections
ar: تتبع الفحوصات

# trackInspectionsDesc
source: Log inspections, queen status, health issues, and treatments with ease.
ar: سجل الفحوصات وحالة الملكة والمشاكل الصحية والعلاجات بسهولة.

source: Record Harvests
ar: تسجيل المحاصيل

# recordHarvestsDesc
source: Keep track of honey production, yields, and quality for each hive.
ar: تتبع إنتاج العسل والغلة والجودة لكل خلية.

source: Buy & Sell
ar: بيع وشراء

# buySellDesc
source: Connect with traders. Sell your honey or buy beekeeping supplies.
ar: تواصل مع التجار. بع عسلك أو اشترِ مستلزمات تربية النحل.

source: Apiaries
ar: المناحل

# noApiaries
source: No apiaries yet
ar: لا توجد مناحل بعد

# addFirstApiary
source: Tap + to add your first apiary
ar: اضغط + لإضافة أول منحل

source: Add Apiary
ar: إضافة منحل

source: Apiary Name
ar: اسم المنحل

# apiaryNameHint
source: Enter apiary name
ar: أدخل اسم المنحل

# apiaryNameRequired
source: Please enter apiary name
ar: الرجاء إدخال اسم المنحل

# apiaryLocation
source: Location
ar: الموقع

# apiaryLocationHint
source: Enter location
ar: أدخل الموقع

# apiaryLocationRequired
source: Please enter location
ar: الرجاء إدخال الموقع

source: Notes
ar: ملاحظات

# notesHint
source: Optional notes
ar: ملاحظات اختيارية

source: Save
ar: حفظ

source: Hives
ar: خلايا

source: Beehives
ar: الخلايا

# noHives
source: No hives yet
ar: لا توجد خلايا بعد

source: Add Hive
ar: إضافة خلية

# createdAt
source: Created
ar: تاريخ الإنشاء

source: Delete Apiary
ar: حذف المنحل

# deleteApiaryConfirm
source: Are you sure you want to delete
ar: هل أنت متأكد من حذف

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

source: Select Image
ar: اختر صورة

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

source: Tap to add photo
ar: اضغط لإضافة صورة

source: Getting location...
ar: جاري تحديد الموقع...

# locationWillBeAdded
source: Location will be added with photo
ar: سيتم إضافة الموقع مع الصورة

# pleaseAddImage
source: Please add a photo
ar: الرجاء إضافة صورة

source: Location
ar: الموقع

source: Tap to take photo
ar: اضغط لالتقاط صورة

# tapToOpenMaps
source: Tap to open in Maps
ar: اضغط لفتح في الخرائط

source: Add Beehive
ar: إضافة خلية

source: Edit Beehive
ar: تعديل الخلية

source: Save Beehive
ar: حفظ الخلية

source: Identification
ar: التعريف

# systemNumber
source: System #
ar: رقم النظام

source: Auto-generated
ar: تلقائي

source: Hive Number
ar: رقم الخلية

# hiveNumberHint
source: e.g., A-5, 12, Blue-2
ar: مثال: أ-5، 12، الزرقاء

source: Please enter hive number
ar: الرجاء إدخال رقم الخلية

source: Name (optional)
ar: الاسم (اختياري)

# nameHint
source: e.g., Strong Colony, New Split
ar: مثال: الخلية القوية، التقسيم الجديد

# hiveInfo
source: Hive Information
ar: معلومات الخلية

source: Frames
ar: إطارات

source: Health Status
ar: الحالة الصحية

source: Queen Info
ar: معلومات الملكة

source: Has Queen
ar: يوجد ملكة

source: Queen present
ar: الملكة موجودة

source: No queen
ar: لا توجد ملكة

source: Queen Origin
ar: مصدر الملكة

source: Queen Breed
ar: سلالة الملكة

source: Queen Added Date
ar: تاريخ إضافة الملكة

source: Select date
ar: اختر التاريخ

source: Queen Marked
ar: الملكة موسومة

source: Marking Color
ar: لون الوسم

source: Photos
ar: الصور

source: Add Photo
ar: إضافة صورة

source: Select Image Type
ar: اختر نوع الصورة

# whatDoesPhotoShow
source: What does this photo show?
ar: ماذا تُظهر هذه الصورة؟

source: Add
ar: إضافة

# addNotesHint
source: Add any notes about this hive...
ar: أضف أي ملاحظات عن هذه الخلية...

# queenTypeLocal
source: Local
ar: محلية

# queenTypeImported
source: Imported
ar: مستوردة

# queenTypeBred
source: Home Bred
ar: مربّاة

# queenTypeSwarm
source: From Swarm
ar: من طرد

# queenTypePurchased
source: Purchased
ar: مشتراة

# queenTypeUnknown
source: Unknown
ar: غير معروف

# queenBreedItalian
source: Italian
ar: إيطالي

# queenBreedCarniolan
source: Carniolan
ar: كرنيولي

# queenBreedBuckfast
source: Buckfast
ar: باكفاست

# queenBreedCaucasian
source: Caucasian
ar: قوقازي

# queenBreedLocal
source: Local
ar: بلدي

# queenBreedHybrid
source: Hybrid
ar: هجين

# queenBreedOther
source: Other
ar: آخر

# healthHealthy
source: Healthy
ar: صحية

# healthWeak
source: Weak
ar: ضعيفة

# healthSick
source: Sick
ar: مريضة

# healthCritical
source: Critical
ar: حرجة

# healthUnknown
source: Unknown
ar: غير معروف

# imageTypeQueen
source: Queen
ar: الملكة

# imageTypeBrood
source: Brood/Eggs
ar: الحضنة

# imageTypeHoney
source: Honey
ar: العسل

# imageTypeFrames
source: Frames
ar: الإطارات

# imageTypeDisease
source: Disease/Problem
ar: مرض

# imageTypeGeneral
source: General
ar: عام

# markingColorWhite
source: White (1, 6)
ar: أبيض (1، 6)

# markingColorYellow
source: Yellow (2, 7)
ar: أصفر (2، 7)

# markingColorRed
source: Red (3, 8)
ar: أحمر (3، 8)

# markingColorGreen
source: Green (4, 9)
ar: أخضر (4، 9)

# markingColorBlue
source: Blue (5, 0)
ar: أزرق (5، 0)

source: Name
ar: الاسم

source: Dates
ar: التواريخ

# updatedAt
source: Updated
ar: آخر تحديث

source: Edit
ar: تعديل

source: Delete Beehive
ar: حذف الخلية

# deleteBeehiveConfirm
source: Are you sure you want to delete this beehive? This action cannot be undone.
ar: هل أنت متأكد من حذف هذه الخلية؟ لا يمكن التراجع عن هذا الإجراء.

source: Hive
ar: خلية

source: Yes
ar: نعم

source: No
ar: لا

source: Add Inspection
ar: إضافة فحص

source: View Inspections
ar: عرض الفحوصات

source: Inspections
ar: الفحوصات

source: Inspection
ar: فحص

source: Inspection Details
ar: تفاصيل الفحص

source: Delete Inspection
ar: حذف الفحص

# deleteInspectionConfirm
source: Are you sure you want to delete this inspection? This action cannot be undone.
ar: هل أنت متأكد من حذف هذا الفحص؟ لا يمكن التراجع عن هذا الإجراء.

# inspectionSaved
source: Inspection saved successfully
ar: تم حفظ الفحص بنجاح

source: Inspection deleted
ar: تم حذف الفحص

source: No inspections yet
ar: لا توجد فحوصات بعد

# noInspectionsDescription
source: Start tracking your hive health by adding your first inspection.
ar: ابدأ بتتبع صحة خليتك بإضافة أول فحص.

source: Add First Inspection
ar: إضافة أول فحص

source: Save Inspection
ar: حفظ الفحص

# inspectingHive
source: Inspecting
ar: فحص الخلية

# basicInfo
source: Basic Information
ar: المعلومات الأساسية

source: Date
ar: التاريخ

source: Time
ar: الوقت

source: Colony Status
ar: حالة الطائفة

source: Queen Seen
ar: شوهدت الملكة

source: Queen Cells Seen
ar: شوهدت بيوت ملكية

source: Eggs Seen
ar: شوهد البيض

source: Larvae Seen
ar: شوهدت اليرقات

source: Brood Pattern
ar: نمط الحضنة

source: Population
ar: التعداد

source: Population Strength
ar: قوة التعداد

source: Frames of Bees
ar: إطارات النحل

source: Frames of Brood
ar: إطارات الحضنة

source: Food Stores
ar: مخزون الغذاء

source: Honey Stores
ar: مخزون العسل

source: Pollen Stores
ar: مخزون حبوب اللقاح

source: Needs Feeding
ar: يحتاج تغذية

# needsFeedingAlert
source: This hive needs feeding!
ar: هذه الخلية تحتاج تغذية!

source: Health
ar: الصحة

source: Temperament
ar: المزاج

source: Diseases Observed
ar: الأمراض الملاحظة

source: Pests Observed
ar: الآفات الملاحظة

source: Issues
ar: مشاكل

source: Actions Taken
ar: الإجراءات المتخذة

source: Action Notes
ar: ملاحظات الإجراءات

# actionNotesHint
source: Describe what you did...
ar: صف ما قمت به...

source: No photos yet
ar: لا توجد صور بعد

# inspectionNotesHint
source: Add any additional observations...
ar: أضف أي ملاحظات إضافية...

source: Queen
ar: الملكة

source: Eggs
ar: البيض

source: Larvae
ar: اليرقات

source: Feed
ar: تغذية

source: Sign Up
ar: إنشاء حساب

source: Logout
ar: تسجيل الخروج

source: Welcome Back
ar: مرحباً بعودتك

# loginToContinue
source: Login to continue managing your apiaries
ar: سجل دخولك لمتابعة إدارة مناحلك

source: Create Account
ar: إنشاء حساب

# signUpToGetStarted
source: Sign up to start managing your bees
ar: سجل للبدء في إدارة نحلك

source: Confirm Password
ar: تأكيد كلمة المرور

source: Full Name
ar: الاسم الكامل

# fullNameHint
source: Enter your full name
ar: أدخل اسمك الكامل

source: Phone Number
ar: رقم الهاتف

# pleaseEnterEmail
source: Please enter your email
ar: الرجاء إدخال البريد الإلكتروني

# pleaseEnterValidEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صحيح

# pleaseEnterPassword
source: Please enter your password
ar: الرجاء إدخال كلمة المرور

# pleaseConfirmPassword
source: Please confirm your password
ar: الرجاء تأكيد كلمة المرور

# pleaseEnterName
source: Please enter your name
ar: الرجاء إدخال اسمك

# pleaseEnterFullName
source: Please enter your full name
ar: الرجاء إدخال اسمك الكامل

# pleaseEnterPhone
source: Please enter your phone number
ar: الرجاء إدخال رقم الهاتف

# passwordTooShort
source: Password must be at least 6 characters
ar: كلمة المرور يجب أن تكون 6 أحرف على الأقل

source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Remember me
ar: تذكرني

source: Forgot Password?
ar: نسيت كلمة المرور؟

# forgotPasswordDescription
source: Enter your email address and we'll send you a link to reset your password.
ar: أدخل بريدك الإلكتروني وسنرسل لك رابط لإعادة تعيين كلمة المرور.

source: Send Reset Link
ar: إرسال رابط الاستعادة

source: Back to Login
ar: العودة لتسجيل الدخول

source: Email Sent!
ar: تم إرسال البريد!

# checkYourEmail
source: We've sent a password reset link to your email. Please check your inbox.
ar: لقد أرسلنا رابط إعادة تعيين كلمة المرور إلى بريدك الإلكتروني. يرجى التحقق من صندوق الوارد.

# didntReceiveEmail
source: Didn't receive the email? Resend
ar: لم تستلم البريد؟ إعادة الإرسال

source: or continue with
ar: أو المتابعة عبر

source: Continue with Google
ar: المتابعة مع جوجل

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

source: I agree to the
ar: أوافق على

source: Terms of Service
ar: شروط الخدمة

source: and
ar: و

source: Privacy Policy
ar: سياسة الخصوصية

# pleaseAcceptTerms
source: Please accept the terms and conditions
ar: الرجاء الموافقة على الشروط والأحكام

# logoutConfirm
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Home
ar: الرئيسية

source: Marketplace
ar: السوق

source: Profile
ar: الملف الشخصي

source: Good Morning
ar: صباح الخير

source: Good Afternoon
ar: مساء الخير

source: Good Evening
ar: مساء الخير

# todayWeather
source: Today's Weather
ar: طقس اليوم

source: Good for inspection
ar: مناسب للفحص

# notGoodForInspection
source: Not ideal for inspection
ar: غير مناسب للفحص

source: Quick Actions
ar: إجراءات سريعة

# newInspection
source: Inspect
ar: فحص

source: Recent Activity
ar: النشاط الأخير

source: Coming Soon
ar: قريباً

# marketplaceComingSoon
source: Buy and sell honey, queens, and equipment
ar: بيع وشراء العسل والملكات والمعدات

source: Edit Profile
ar: تعديل الملف

source: Notifications
ar: الإشعارات

source: Language
ar: اللغة

source: Help & Support
ar: المساعدة والدعم

# memberSince
source: Member
ar: عضو منذ
